"%@ days ago" = "%@ giorno/i fa";
"Autocomplete" = "Autocompletamento";
"Ecosia recommends" = "Ecosia raccomanda";
"Ecosia won’t remember the pages you visited, your search history or your autofill information once you close a tab. Your searches still contribute to trees." = "Ecosia non memorizzerà le pagine che hai visitato, la tua cronologia delle ricerche o le informazioni di autoriempimento quando chiudi una scheda. Le tue ricerche contribuiscono comunque a piantare alberi.";
"Explore Ecosia" = "Esplora Ecosia";
"FAQ" = "FAQ";
"Financial reports" = "Report finanziari";
"Get started" = "Inizia";
"How Ecosia works" = "Come funziona Ecosia";
"Keep up to date with the latest news from our projects and more" = "Resta aggiornato con le ultime novità sui nostri progetti e molto altro";
"Moderate" = "Moderato";
"More" = "Altro";
"My searches" = "Le mie ricerche";
"New" = "Novità";
"Off" = "Disattivato";
"Private" = "Privato";
"Personalized results" = "Risultati personalizzati";
"Plant trees while you browse the web" = "Pianta alberi mentre navighi in internet";
"Privacy" = "Privacy";
"Relevant results based on past searches" = "Risultati pertinenti sulla base delle ricerche precedenti";
"Safe search" = "Ricerca sicura";
"Search" = "Cerca";
"Search region" = "Regione di ricerca";
"Send feedback" = "Invia feedback";
"Shop" = "Shop";
"Shown under the search field" = "Appare sotto la casella di ricerca";
"Start using these green companies to plant more trees and become more sustainable" = "Inizia a utilizzare queste società eco-friendly per piantare più alberi e diventare più sostenibile";
"Stories" = "News";
"Strict" = "Rigoroso";
"TREES" = "alberi";
"TREES PLANTED WITH ECOSIA" = "Alberi piantati con Ecosia";
"Terms and conditions" = "Termini e condizioni";
"Version %@" = "Versione %@";
"We use the profit from your searches to plant trees where they are needed most" = "Utilizziamo i guadagni derivanti dalle tue ricerche per piantare alberi dove ce n'è più bisogno";
"Websites will always open with Ecosia, planting even more trees" = "I siti web verranno sempre aperti con Ecosia, piantando ancora più alberi";
"You need around 45 searches to plant a tree. Keep going!" = "Ci vogliono circa 45 ricerche per piantare un albero. Continua così!";
